In [ ]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.12/site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/anaconda3/lib/python3.12/site-packages (0.5.0)
Requirement already satisfied: prettytable in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (8.27.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: decorator in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /opt/anaconda3/lib/python3.12/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /opt/anaconda3/lib/python3.12/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/anaconda3/lib/python3.12/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
%load_ext sql
from sqlalchemy import create_engine

In [ ]:
pip install ipython-sql pandas

Requirement already satisfied: ipython-sql in /opt/anaconda3/lib/python3.12/site-packages (0.5.0)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: prettytable in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (8.27.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: decorator in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /opt/anaconda3/lib/python3.12/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /opt/anaconda3/lib/python3.12/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/anaconda3/lib/python3.12/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
%sql postgresql://postgres:@localhost:5432/customerdb
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%sql postgresql://postgres:polpol@localhost:5432/customerdb

Question 1: How do the number of customers and the number of transactions vary across different income group?

In [ ]:
%%sql
SELECT i.income_group_desc, count (distinct(c.customer_identifier)) AS customers, count(t.customer_identifier) as transactions
FROM customers c
JOIN income_group as i
ON i.income_group_code = c.income_group_code
JOIN transactions t
ON c.customer_identifier = t.customer_identifier
GROUP BY i.income_group_code, i.income_group_desc
OFFSET 1 ROW

 * postgresql://postgres:***@localhost:5432/customerdb
21 rows affected.

[('R 0 - 499', 62, 14994),
 ('R500 - 999', 30, 2496),
 ('R1,000 - 1,999', 96, 8319),
 ('R2,000 - 2,999', 82, 5889),
 ('R3,000 - 3,999', 150, 13395),
 ('R4,000 - 4,999', 438, 38242),
 ('R5,000 - 5,999', 373, 40719),
 ('R6,000 - 6,999', 357, 41316),
 ('R7,000 - 7,999', 331, 47822),
 ('R8,000 - 8,999', 305, 47663),
 ('R9,000 - 9,999', 200, 31597),
 ('R10,000 - 11,999', 438, 69661),
 ('R12,000 - 14,999', 459, 84208),
 ('R15,000 - 19,999', 597, 131996),
 ('R20,000 - 24,999', 451, 105093),
 ('R25,000 - 33,999', 403, 90633),
 ('R34,000 - 41,999', 186, 42675),
 ('R42,000 - 62,999', 115, 23648),
 ('R63,000 - 84,999', 48, 6101),
 ('R85,000 - 124,999', 15, 824),
 ('R125,000+', 6, 117)]

Question 2: Which product code (account type) has the most significant cash flow?

In [ ]:
%%sql

SELECT
    EXTRACT(YEAR FROM record_date) AS transaction_year,
    EXTRACT(MONTH FROM record_date) AS transaction_month,
    product_code  AS account_type,
    SUM(amt) as cash_flow
FROM transactions
WHERE product_code = 'CHEQ' OR product_code = 'SAVE'
GROUP BY product_code, transaction_year, transaction_month
ORDER BY transaction_year, transaction_month;

 * postgresql://postgres:***@localhost:5432/customerdb
28 rows affected.

[(Decimal('2021'), Decimal('7'), 'CHEQ', -15400.520000000059),
 (Decimal('2021'), Decimal('7'), 'SAVE', 2509.469999999992),
 (Decimal('2021'), Decimal('8'), 'CHEQ', -104053.47999999997),
 (Decimal('2021'), Decimal('8'), 'SAVE', 6884.0700000000215),
 (Decimal('2021'), Decimal('9'), 'CHEQ', 117961.5200000002),
 (Decimal('2021'), Decimal('9'), 'SAVE', 107298.51999999995),
 (Decimal('2021'), Decimal('10'), 'CHEQ', -371629.63999999996),
 (Decimal('2021'), Decimal('10'), 'SAVE', 19935.730000000032),
 (Decimal('2021'), Decimal('11'), 'CHEQ', 302616.53000000154),
 (Decimal('2021'), Decimal('11'), 'SAVE', 269742.70000000054),
 (Decimal('2021'), Decimal('12'), 'CHEQ', -839668.3899999993),
 (Decimal('2021'), Decimal('12'), 'SAVE', 26184.890000001236),
 (Decimal('2022'), Decimal('1'), 'CHEQ', 203843.02000000194),
 (Decimal('2022'), Decimal('1'), 'SAVE', 327959.9700000001),
 (Decimal('2022'), Decimal('2'), 'CHEQ', 369670.0200000002),
 (Decimal('2022'), Decimal('2'), 'SAVE', 1508086.1000000047),
 (Decimal('2022'), Decimal('3'), 'CHEQ', 154275.28000000137),
 (Decimal('2022'), Decimal('3'), 'SAVE', 29550.690000002905),
 (Decimal('2022'), Decimal('4'), 'CHEQ', 1347654.8000000105),
 (Decimal('2022'), Decimal('4'), 'SAVE', -37089.38999999892),
 (Decimal('2022'), Decimal('5'), 'CHEQ', 2001785.3500000136),
 (Decimal('2022'), Decimal('5'), 'SAVE', 36403.33000000179),
 (Decimal('2022'), Decimal('6'), 'CHEQ', 2115125.610000016),
 (Decimal('2022'), Decimal('6'), 'SAVE', -126639.2999999992),
 (Decimal('2022'), Decimal('7'), 'CHEQ', 1370629.4500000048),
 (Decimal('2022'), Decimal('7'), 'SAVE', -653547.2899999999),
 (Decimal('2022'), Decimal('8'), 'CHEQ', 2512645.4100000067),
 (Decimal('2022'), Decimal('8'), 'SAVE', -183860.27000000037)]

Question 3: How does the average account balance vary across different income groups (3 month analysis)

In [ ]:
%%sql
SELECT
EXTRACT(MONTH FROM record_date) AS transaction_month,
i.income_group_desc, AVG(t.account_balance) AS average_account_balance
FROM customers c
JOIN income_group i
ON i.income_group_code = c.income_group_code
JOIN transactions t
ON c.customer_identifier = t.customer_identifier
WHERE EXTRACT(MONTH FROM record_date) between 1 and 3
GROUP BY i.income_group_code, i.income_group_desc, transaction_month
order by transaction_month

 * postgresql://postgres:***@localhost:5432/customerdb
66 rows affected.

[(Decimal('1'), 'NOT SUPPLIED', 1740.214571428571),
 (Decimal('1'), 'R 0 - 499', 5353.412958387528),
 (Decimal('1'), 'R500 - 999', 6765.311477663232),
 (Decimal('1'), 'R1,000 - 1,999', 6061.4249596774225),
 (Decimal('1'), 'R2,000 - 2,999', 4023.5963103953204),
 (Decimal('1'), 'R3,000 - 3,999', 3091.1025121555895),
 (Decimal('1'), 'R4,000 - 4,999', 2416.4665931304107),
 (Decimal('1'), 'R5,000 - 5,999', 2913.652536143099),
 (Decimal('1'), 'R6,000 - 6,999', 2511.2743612552554),
 (Decimal('1'), 'R7,000 - 7,999', 4428.129973850532),
 (Decimal('1'), 'R8,000 - 8,999', 2930.9554196113177),
 (Decimal('1'), 'R9,000 - 9,999', 4399.920516556303),
 (Decimal('1'), 'R10,000 - 11,999', 4191.134660796757),
 (Decimal('1'), 'R12,000 - 14,999', 4934.32966670809),
 (Decimal('1'), 'R15,000 - 19,999', 5192.1995058118755),
 (Decimal('1'), 'R20,000 - 24,999', 6312.187069802882),
 (Decimal('1'), 'R25,000 - 33,999', 6955.790742710609),
 (Decimal('1'), 'R34,000 - 41,999', 8625.750497237583),
 (Decimal('1'), 'R42,000 - 62,999', 6979.381429209464),
 (Decimal('1'), 'R63,000 - 84,999', 6415.75373015873),
 (Decimal('1'), 'R85,000 - 124,999', 1870.4110638297868),
 (Decimal('1'), 'R125,000+', 2455.4645454545457),
 (Decimal('2'), 'NOT SUPPLIED', 1313.5717647058823),
 (Decimal('2'), 'R 0 - 499', 5208.849652173907),
 (Decimal('2'), 'R500 - 999', 6595.485785953178),
 (Decimal('2'), 'R1,000 - 1,999', 5436.324609218437),
 (Decimal('2'), 'R2,000 - 2,999', 3823.3964212076667),
 (Decimal('2'), 'R3,000 - 3,999', 3107.8583551273314),
 (Decimal('2'), 'R4,000 - 4,999', 2586.305117924534),
 (Decimal('2'), 'R5,000 - 5,999', 3231.8733270479756),
 (Decimal('2'), 'R6,000 - 6,999', 3181.1803977055442),
 (Decimal('2'), 'R7,000 - 7,999', 3377.8228132387535),
 (Decimal('2'), 'R8,000 - 8,999', 3365.7372357446766),
 (Decimal('2'), 'R9,000 - 9,999', 4353.99798057259),
 (Decimal('2'), 'R10,000 - 11,999', 4434.415149100611),
 (Decimal('2'), 'R12,000 - 14,999', 4577.015165357824),
 (Decimal('2'), 'R15,000 - 19,999', 5118.103310375837),
 (Decimal('2'), 'R20,000 - 24,999', 6028.254469477285),
 (Decimal('2'), 'R25,000 - 33,999', 6813.125905556627),
 (Decimal('2'), 'R34,000 - 41,999', 7504.224260038237),
 (Decimal('2'), 'R42,000 - 62,999', 6855.94443952298),
 (Decimal('2'), 'R63,000 - 84,999', 6506.24890745503),
 (Decimal('2'), 'R85,000 - 124,999', 4100.925158730156),
 (Decimal('2'), 'R125,000+', 961.98),
 (Decimal('3'), 'NOT SUPPLIED', 259.96833333333336),
 (Decimal('3'), 'R 0 - 499', 4509.696012516771),
 (Decimal('3'), 'R500 - 999', 6296.358957746487),
 (Decimal('3'), 'R1,000 - 1,999', 5587.662643957823),
 (Decimal('3'), 'R2,000 - 2,999', 3995.7766055045986),
 (Decimal('3'), 'R3,000 - 3,999', 2967.7520277207364),
 (Decimal('3'), 'R4,000 - 4,999', 2595.151213413444),
 (Decimal('3'), 'R5,000 - 5,999', 3099.2569470827566),
 (Decimal('3'), 'R6,000 - 6,999', 2889.057126272547),
 (Decimal('3'), 'R7,000 - 7,999', 3563.4155462323292),
 (Decimal('3'), 'R8,000 - 8,999', 3444.5677228031914),
 (Decimal('3'), 'R9,000 - 9,999', 4416.666812486258),
 (Decimal('3'), 'R10,000 - 11,999', 4353.05447122939),
 (Decimal('3'), 'R12,000 - 14,999', 4647.489248862565),
 (Decimal('3'), 'R15,000 - 19,999', 5312.92221839645),
 (Decimal('3'), 'R20,000 - 24,999', 6584.467612903219),
 (Decimal('3'), 'R25,000 - 33,999', 6909.23689161216),
 (Decimal('3'), 'R34,000 - 41,999', 7268.406976980293),
 (Decimal('3'), 'R42,000 - 62,999', 7453.475520931675),
 (Decimal('3'), 'R63,000 - 84,999', 7272.786817610062),
 (Decimal('3'), 'R85,000 - 124,999', 4392.808611111112),
 (Decimal('3'), 'R125,000+', 1361.7054545454544)]

Question 4: Which transaction channel generated the highest transaction volume?

In [ ]:
%%sql

SELECT t.channel, COUNT(t.customer_identifier) as total_transaction, ROUND(SUM(t.amt)) as total_transaction_amount
FROM transactions t
JOIN customers c
ON t.customer_identifier = c.customer_identifier
GROUP BY t.channel
ORDER BY total_transaction_amount DESC

 * postgresql://postgres:***@localhost:5432/customerdb
4 rows affected.

[('system', 509581, 74810502.0),
 ('teller', 21464, 61690496.0),
 ('internet', 119238, -29068726.0),
 ('atm', 197261, -96933397.0)]

Question 5: Are there any unusual patterns in transactions (e.g. unusally high amounts for certain account type code) that could indicate fraud?

REASON: This question investigates unusual transaction patterns to identify potential fraud or system anomalies. High transaction amounts, especially when inconsistent with typical account behavior, could indicate misuse, errors, or fraudulent activities. Early detection of such patterns is critical for financial institutions to maintain trust, reduce losses, and ensure data integrity.

In [ ]:
%%sql

SELECT
    product_code,
    PERCENTILE_CONT(0.9999) WITHIN GROUP (ORDER BY amt) AS threshold
FROM
    transactions
GROUP BY
    product_code;

 * postgresql://postgres:***@localhost:5432/customerdb
2 rows affected.

[('CHEQ', 46201.23472200037), ('SAVE', 45040.38328000021)]

In [ ]:
%%sql

WITH percentiles AS (
    SELECT
        account_type_code,
        PERCENTILE_CONT(0.9999) WITHIN GROUP (ORDER BY amt) AS threshold_amt
    FROM
        transactions
    GROUP BY
        account_type_code
)

 * postgresql://postgres:***@localhost:5432/customerdb
(psycopg2.errors.SyntaxError) syntax error at end of input
LINE 9: )
         ^

[SQL: WITH percentiles AS (
    SELECT
        account_type_code,
        PERCENTILE_CONT(0.9999) WITHIN GROUP (ORDER BY amt) AS threshold_amt
    FROM
        transactions
    GROUP BY
        account_type_code
)]
(Background on this error at: https://sqlalche.me/e/20/f405)